# ApparentPowerDensity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..ApparentPowerDensity Property
AreaBasedLoadData Class See Also
---
The apparent power density of the area based load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double ApparentPowerDensity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApparentPowerDensity As Double
	Get
```

Visual C++
---
```text
public:
property double ApparentPowerDensity {
	double get ();
}
```

# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace